erpdev.СХК_Расширение/src/DataProcessors/СХК_МобильныйСклад/СХК_МобильныйСклад.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>СХК_МобильныйСклад</name>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

erpdev.СХК_Расширение/src/Documents/СХК_Перемещение/СХК_Перемещение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СХК_Перемещение</name>
  <registerRecords>AccumulationRegister.СХК_ТоварыНаСкладе</registerRecords>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Сторно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧТовары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекЯчейка</name>
      <type>
        <types>CatalogRef.СХК_СкладЯчейки</types>
      </type>
    </attributes>
    <attributes>
      <name>НЯчейка</name>
      <type>
        <types>CatalogRef.СХК_СкладЯчейки</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Время</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

erpdev.СХК_Расширение/src/Catalogs/СХК_СкладЯчейки/СХК_СкладЯчейки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СХК_СкладЯчейки</name>
  <attributes>
    <name>Ряд</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Секция</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ячейка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВМестимость</name>
    <type>
      <types>EnumRef.СХК_ВМестимость</types>
    </type>
  </attributes>
  <attributes>
    <name>ШтрихКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Блокировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

erpdev.СХК_Расширение/src/DataProcessors/СХК_МобильныйСклад/Forms/ФормаИнвентаризация/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)  
	ЗаполнитьСотрудника(ВладелецФормы.Сотрудник);
	СтартТайминг() ;
	
	АктивироватьСканЯчейки();
КонецПроцедуры               

&НаСервере
Процедура ЗаполнитьСотрудника(ИмяПользователя) 
	ЭтаФорма.Сотрудник = Пользователи.ПользовательПоНаименованию(ИмяПользователя);
	Обработки.СХК_МобильныйСклад.ИзменитьТайминг(ЭтаФорма.Сотрудник)
КонецПроцедуры 

&НаСервере
Процедура СтартТайминг() 
	Обработки.СХК_МобильныйСклад.ИзменитьТайминг(ЭтаФорма.Сотрудник)
КонецПроцедуры


&НаКлиенте
Процедура АктивироватьСканЯчейки() Экспорт 

	ЭтаФорма.Элементы.СканЯчейки.РедактированиеТекста = Истина;
	ОчиститьСканИнфо(); 
	Элементы.СканЯчейки.ОбновитьТекстРедактирования();
	Элементы.СканЯчейки.Видимость = Ложь;
	Элементы.СканЯчейки.Видимость = Истина;
	ЭтаФорма.ТекущийЭлемент = Элементы.СканЯчейки; 
	# Если МобильныйКлиент Тогда
		НачатьРедактированиеЭлемента();
	#КонецЕсли
	
КонецПроцедуры             

&НаСервере
Процедура ОчиститьСканИнфо()
	СканЯчейки = ""; 
	ЭтаФорма.Ячейка = Справочники.СХК_СкладЯчейки.ПустаяСсылка();
	ЭтаФорма.Элементы.ИнформацияЯчейка.Заголовок = "";  
КонецПроцедуры

&НаКлиенте
Процедура СканЯчейкиИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	ЗаполнитьИнформациюПоШК(Текст);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИнформациюПоШК(ШтрихКод)
	ЯчейкаПоиск = СХК_ТСДСклад.ПоискЯчейкиШК(ШтрихКод);
	ТесктИЯ = "";

	Если ЯчейкаПоиск <> Неопределено Тогда
		ЭтаФорма.Ячейка = ЯчейкаПоиск; 
		СодержаниеЯчейки = СХК_ТСДСклад.СодержимоеЯчейки(ЯчейкаПоиск);
		Если СодержаниеЯчейки.Количество()>= 1 Тогда
			Для Каждого стр из СодержаниеЯчейки Цикл
				
				ТесктИЯ = ТесктИЯ + Строка(стр.Номенклатура) + Символы.ПС + 
				Строка(стр.Серия) + Символы.ПС +
				Строка(стр.ВНаличииОстаток) + Символы.ПС + "---------------"+ Символы.ПС;
				
			КонецЦикла;                                                                    
			ЭтаФорма.Элементы.ИнформацияЯчейка.Заголовок = ТесктИЯ;
			ЭтаФорма.Элементы.ГруппаОчистить.Видимость = Истина;	
		Иначе
			ЭтаФорма.Элементы.ГруппаОчистить.Видимость = Ложь;	
		КонецЕсли;
	Иначе
		ЭтаФорма.Элементы.ИнформацияЯчейка.Заголовок = "Отсканируйте ШтрихКод ячейки";
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура Очистить(Команда)
	//@skip-check undefined-function
	Ответ = Вопрос("Очистить ячейку ?",
	РежимДиалогаВопрос.ДаНет,
	0, // таймаут в секундах
	КодВозвратаДиалога.Да, // (необ.) кнопка по умолчанию
	"Очистить ячейку" // (необ.) заголовок
	);
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ПеренестиТОварыВБуфер();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПеренестиТОварыВБуфер()
	
	Буфер = Справочники.СХК_СкладЯчейки.НайтиПоНаименованию("Буфер");
	
	ТоварыВЯчейке = СХК_ТСДСклад.СодержимоеЯчейки(ЭтаФорма.Ячейка);	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	СХК_Перемещение.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.СХК_Перемещение КАК СХК_Перемещение
	               |ГДЕ
	               |	СХК_Перемещение.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	               |	И СХК_Перемещение.ПометкаУдаления = &ПометкаУдаления
	               |	И СХК_Перемещение.Проведен = &Проведен
	               |	И СХК_Перемещение.Автор = &Автор"; 
	Запрос.УстановитьПараметр("ПометкаУдаления", Ложь);  
	Запрос.УстановитьПараметр("Проведен", Истина);
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ТекущаяДата())); 
	Запрос.УстановитьПараметр("Автор", ЭтаФорма.Сотрудник); 

	Рез = Запрос.Выполнить().Выбрать();
	
	Если Рез.Следующий() Тогда
		ТекДок = Рез.Ссылка.ПолучитьОбъект();
	Иначе
		ТекДок = Документы.СХК_Перемещение.СоздатьДокумент();
		ТекДок.Дата =ТекущаяДата();
		ТекДок.Автор = ЭтаФорма.Сотрудник;
	КонецЕсли;
	
	Для Каждого стр из ТоварыВЯчейке Цикл
		НоваяСтрока = ТекДок.ТЧТовары.Добавить();
	    НоваяСтрока.Номенклатура = стр.Номенклатура;
	    НоваяСтрока.Серия = Справочники.СерииНоменклатуры.НайтиПоНаименованию(стр.Серия);
	    НоваяСтрока.ТекЯчейка = ЭтаФорма.Ячейка; 
		НоваяСтрока.НЯчейка = Буфер; 
		НоваяСтрока.Количество = стр.ВНаличииОстаток;
		НоваяСтрока.Время = ТекущаяДата(); 
 		НоваяСтрока.Пользователь = ЭтаФорма.Сотрудник;
		
	КонецЦикла;
 	ТекДок.Записать(РежимЗаписиДокумента.Проведение);
	ЭтаФорма.Элементы.ИнформацияЯчейка.Заголовок = "Товар перемещен в буфер";  
	
КонецПроцедуры


	
&НаКлиенте
Процедура Разместить(Команда)
	Если Ячейка.Пустая() ТОгда
		Элементы.ИнформацияЯчейка.Заголовок = "Отсканируйте ячейку";
	Иначе
		//ЭтаФорма.Закрыть();
		СтруктураПараметры = Новый Структура;
		СтруктураПараметры.Вставить("Ячейка",ЯчейкаФорма());
		АдресПередаваемыхПараметров = ПоместитьВоВременноеХранилище(СтруктураПараметры,Новый УникальныйИдентификатор);
		_Параметры = новый Структура("Адрес", АдресПередаваемыхПараметров);
		_Параметры.Вставить("ЗакрыватьПриЗакрытииВладельца",Истина);
		ОткрытьФорму("Обработка.СХК_МобильныйСклад.Форма.ФормаПеремещение", _Параметры,ЭтаФорма, , , , ,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		//ОткрытьФорму("Обработка.СХК_МобильныйСклад.Форма.Разместить", _Параметры,ЭтаФорма, , , , ,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	КонецЕсли;

КонецПроцедуры


&НаСервере
Функция ЯчейкаФорма()
	Возврат ЭтаФорма.Ячейка.Ссылка;
КонецФункции
